uhnp/src/InformationRegisters/ШаблоныАналитикПлатежей/ШаблоныАналитикПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШаблоныАналитикПлатежей</name>
  <resources>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаБДДС1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаБДДС2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаБДДС3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаБДДС4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаБДДС5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаБДДС6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетОрганизации</name>
    <type>
      <types>DefinedType.БанковскийСчетОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ПредназначенияЭлементовСтруктурыОтчета/ПредназначенияЭлементовСтруктурыОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПредназначенияЭлементовСтруктурыОтчета</name>
  <enumValues>
    <name>ПроизвольныеДанные</name>
  </enumValues>
  <enumValues>
    <name>ОборотноСальдоваяВедомость</name>
  </enumValues>
  <enumValues>
    <name>БюджетДвиженияДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>БюджетДоходовИРасходов</name>
  </enumValues>
  <enumValues>
    <name>БюджетДвиженияРесурсов</name>
  </enumValues>
  <enumValues>
    <name>ТрансформационныеКорректировки</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/ШаблоныАналитикПлатежей/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запись.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();

	ОбработатьВидыАналикСтатьи();
	УстановитьУсловноеОформление();
	ЗаполнитьСписокВыбораХозяйственнаяОперация();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатьяДвиженияДенежныхСредствПриИзменении(Элемент)
	
	ОбработатьВидыАналикСтатьи();

КонецПроцедуры

&НаКлиенте
Процедура НазначениеПлатежаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НазначениеПлатежаРедакторЗавершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ШаблонНазначенияПлатежа", Элемент.ТекстРедактирования);
	ОткрытьФорму("РегистрСведений.ШаблоныАналитикПлатежей.Форма.РедакторШаблонаНазначенияПлатежа",ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
Процедура УстановитьСвязиПараметровВыбораВШапке() 
	
	КодВидаБюджета = ДвиженияБюджетированиеКлиентСерверУХ.КодВидаБюджета(Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств);
	
	ШаблонИмениРеквизита = "Аналитика" + КодВидаБюджета + "%1";
	
	ШаблонИмениЭлемента = "Аналитика" + КодВидаБюджета + "%1";
	
	Если ЗначениеЗаполнено(Запись.СтатьяДвиженияДенежныхСредств) Тогда
		МассивАналитик = ОперативноеПланированиеФормыУХ.ПолучитьМассивАналитикСтатьи(ЭтаФорма, ШаблонИмениРеквизита);
		ДанныеАналитики = ОбщегоНазначенияУХ.ПолучитьДанныеГруппыРаскрытияТЧ(,Новый Структура("Аналитики", МассивАналитик));
	Иначе
		Возврат;
	КонецЕсли;
	
	Для Индекс= 1 По АналитикиСтатейБюджетовУХКлиентСервер.КоличествоАналитикСтатьи() Цикл
		
		ИмяЭлемента		= СтрШаблон(ШаблонИмениЭлемента, Индекс);
		ИмяРеквизита	= СтрШаблон(ШаблонИмениРеквизита, Индекс);
		
		ИмяЭлементаВидАналитики = "ВидАналитики" + Индекс;
		Элемент=Элементы[ИмяЭлемента];
		
		
		ТекВидАналитики = ДанныеАналитики[ИмяРеквизита];
		
		Если Не ЗначениеЗаполнено(ТекВидАналитики.ВидАналитики) Тогда
			
			Продолжить;
			
		ИначеЕсли ТекВидАналитики.ТаблицаАналитики="Справочник.ПроизвольныйКлассификаторУХ" Тогда
			
			СвязиПараметровВыбора = Новый Массив;
			СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", ИмяЭлементаВидАналитики));
			Элемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
			
		ИначеЕсли ТекВидАналитики.Свойство("ТипыВладельцев") Тогда
			
			ПолеВладельца="";
			
			Для Каждого КлючИЗначение ИЗ ДанныеАналитики Цикл // Ищем поле субконто с тем же типом, что и владелец
				
				Если Не ЗначениеЗаполнено(КлючИЗначение.Значение.ВидАналитики) Тогда
					
					Продолжить;
					
				ИначеЕсли НЕ ТекВидАналитики.ТипыВладельцев.НайтиПоЗначению(КлючИЗначение.Значение.Тип)=Неопределено Тогда
					
					ПолеВладельца = "Запись." + КлючИЗначение.Ключ;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(ПолеВладельца) Тогда
				
				СвязиПараметровВыбора = Новый Массив;
				СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", ПолеВладельца));
				Элемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
				
			КонецЕсли;
			
		Иначе
			
			СвязиПараметровВыбора = Новый Массив;
			Элемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура УстановитьУсловноеОформление()
	
	Для Индекс= 1 По АналитикиСтатейБюджетовУХКлиентСервер.КоличествоАналитикСтатьи() Цикл
	
		ИмяЭлемента="АналитикаБДДС" + Индекс;
		
		ИмяРеквизита = "ВидАналитики" + Индекс;
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();

		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ИмяЭлемента);

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			ИмяРеквизита, ВидСравненияКомпоновкиДанных.НеЗаполнено,,,Истина);

		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбработатьВидыАналикСтатьи()
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, 
		АналитикиСтатейБюджетовУХ.СтруктураВидовАналитикСтатейБюджетов(Запись.СтатьяДвиженияДенежныхСредств));
	
	Для Индекс = 1 По АналитикиСтатейБюджетовУХКлиентСервер.КоличествоАналитикСтатьи() Цикл
		Элемент = Элементы["АналитикаБДДС" + Индекс];
		Если НЕ ЗначениеЗаполнено(ЭтаФорма["ВидАналитики" + Индекс]) Тогда
			
			Запись["АналитикаБДДС" + Индекс] = Неопределено;
			Элемент.ТолькоПросмотр = Истина;
			Элемент.ПодсказкаВвода = НСтр("ru = '<Не используется>'");
			
		Иначе
			
			Элемент.ТолькоПросмотр = Ложь;
			Элемент.ПодсказкаВвода = ЭтаФорма["ВидАналитики" + Индекс];
			Элемент.ОграничениеТипа = ЭтаФорма["ВидАналитики" + Индекс].ТипЗначения;
		
		КонецЕсли;
	КонецЦикла;
	
	УстановитьСвязиПараметровВыбораВШапке();
	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеПлатежаРедакторЗавершение(ВведенныйТекст, Параметры) Экспорт
	
	Если ТипЗнч(ВведенныйТекст) <> Тип("Строка") Тогда
		Возврат;
   	КонецЕсли;	
	
	Запись.НазначениеПлатежа = ВведенныйТекст;
	Модифицированность = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбораХозяйственнаяОперация()

	Элементы.ХозяйственнаяОперация.СписокВыбора.Очистить();
	
	// Поступление безналичных денежных средств
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОплатыПоПлатежнойКарте, "Поступление оплаты по эквайрингу");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации, "Поступление от другой организации");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств, "Передача между организацией и филиалом");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствСДругогоСчета, "Поступление с другого счета");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет, "Инкассация в банк");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствПоКредитам, "Поступление по кредитам и займам полученным");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствПоДепозитам, "Поступление по депозитам");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствПоЗаймамВыданным, "Погашение займа контрагентом");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПогашениеЗаймаСотрудником, "Погашение займа сотрудником");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.КонвертацияВалюты);
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПрочееПоступлениеДенежныхСредств, "Прочее поступление");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика);
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника, "Возврат от подотчетника");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации, "Возврат от другой организации");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтАрендодателя, "Возврат от арендодателя");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВозвратНеперечисленныхДС);
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВозвратНеперечисленнойЗарплатыПоЗарплатномуПроекту);
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВозвратНалогов);
	
	// Списание безналичных денежных средств
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику, "Выдача подотчетнику");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет);
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПеречислениеТаможне);
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию, "Оплата другой организации");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств, "Передача между организацией и филиалом");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту);
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета);
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ОплатаАрендодателю);
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет, "Перечисление на другой счет");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств, "Инкассация из банка");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ОплатаПоКредитам);
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПеречислениеНаДепозиты);
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВыдачаЗаймов, "Выдача займа контрагенту");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику, "Выдача займа сотруднику");
	//Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.КонвертацияВалюты);
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств, "Прочий расход");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию, "Возврат в другую организацию");
	Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту, "Возврат оплаты по эквайрингу");

	Элементы.ХозяйственнаяОперация.СписокВыбора.СортироватьПоЗначению();
	
КонецПроцедуры

#КонецОбласти
